Комплексная_автоматизация_2_МОМ_2019/src/Enums/СпособыРаспределенияЗатратНаВыходныеИзделия/СпособыРаспределенияЗатратНаВыходныеИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРаспределенияЗатратНаВыходныеИзделия</name>
  <enumValues>
    <name>ПоДолямСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ПоПлановойСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ПоВесу</name>
  </enumValues>
  <enumValues>
    <name>ПоОбъему</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеПродукцииИМатериалов</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыМатериаловВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютеРегл</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказовРаботами</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикПоступленияТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДвиженияПродукцииИМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМаркируемаяПродукцияГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоТоварамКОформлениюОтчетовКомитенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <type>
      <types>EnumRef.ВариантыПриемкиТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОтправителя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОтправитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийПолучатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОтправителя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПолучателя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасовПолучателя</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Комплексная_автоматизация_2_МОМ_2019/src/CommonModules/ПроизводствоКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Производство"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Трудозатраты

// Открывает форму выбора исполнителя трудозатрат в производстве. В зависимости от параметров переданного
// подразделения в форме могут быть выбраны бригады и/или физические лица.
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации - значение для отбора исполнителей.
//  Подразделение		 - СправочникСсылка.СтруктураПредприятия - определяет состав исполнителей, доступных для выбора.
//  Исполнитель			 - СправочникСсылка.Бригады, СправочникСсылка.ФизическиеЛица - используется для позиционирования строки
//							на выбранном ранее значении.
//  ОписаниеОповещения	 - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана при закрытии формы.
//
Процедура ОткрытьФормуВыбораИсполнителя(Организация, Подразделение, Исполнитель, ОписаниеОповещения) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Подразделение", Подразделение);
	ПараметрыФормы.Вставить("Исполнитель", Исполнитель);
	
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителя", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область Продукция

// Открывает форму выбора получателя в производстве. В зависимости от типа номенклатуры выбранных строк
// в форме можно выбрать подразделение (структура предприятия) или склад
//
// Параметры:
//  Форма			     - ФормаКлиентскогоПриложения   - Обрабатываемая форма
//  Объект               - ДанныеФормыСтруктура (по типу объекта)
//  ПараметрыТЧ		     - Структура          - содержит имена (представление) ТЧ: 
//											    ИмяТЧФорма      - имя таблицы формы
//                                              ИмяТЧОбъект     - имя табличной части объекта
//                                              ПредставлениеТЧ - представление табличной части для выводимых текстов
//  ТипыНоменклатуры     - Массив             - массив значений перечисления ТипыНоменклатуры для которых открывается форма,
//                                              если неопределено, тогда ограничения по типам не устанавливается
//  ОписаниеОповещения	 - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана при закрытии формы
//
Процедура ОткрытьФормуВыбораПолучателя(Форма, Объект, ПараметрыТЧ, ТипыНоменклатуры = Неопределено, ОписаниеОповещения) Экспорт
	
	ИмяТЧФорма       = ПараметрыТЧ.ИмяТЧФорма;
	ИмяТЧОбъект      = ПараметрыТЧ.ИмяТЧОбъект;
	ПредставлениеТЧ  = ПараметрыТЧ.ПредставлениеТЧ;
	
	Элементы         = Форма.Элементы;
	ВыделенныеСтроки = Элементы[ИмяТЧФорма].ВыделенныеСтроки;
	
	Если Объект[ИмяТЧОбъект].Количество() = 0 Тогда
		
		ТекстОшибки = НСтр("ru = 'В список ""%1"" не введено ни одной строки.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ПредставлениеТЧ);
		
		ПоказатьПредупреждение(, ТекстОшибки, 45);
		Возврат;
	Иначе
		
		ТипНоменклатурыРабота   = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа");
		
		НаличиеЗапрещенногоТипа = Ложь;
		ВыборПодразделение      = Ложь;
		ВыборСклада             = Ложь;
		
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Объект[ИмяТЧОбъект].НайтиПоИдентификатору(Строка);
			
			Если ТипыНоменклатуры <> Неопределено 
			   И ТипыНоменклатуры.Найти(ДанныеСтроки.ТипНоменклатуры) = Неопределено Тогда
				НаличиеЗапрещенногоТипа = Истина;
				Прервать;
			КонецЕсли;	
			
			Если ДанныеСтроки.СписатьНаРасходы 
			 Или ДанныеСтроки.ТипНоменклатуры = ТипНоменклатурыРабота Тогда
				ВыборПодразделение = Истина;
			Иначе
				ВыборСклада        = Истина;
			КонецЕсли;	
			
			Если ВыборПодразделение И ВыборСклада Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если НаличиеЗапрещенногоТипа Тогда
			
			ТекстОшибки = НСтр("ru = 'Для выбранной номенклатуры (тип ""%1"") операция не может быть выполнена.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Строка(ДанныеСтроки.ТипНоменклатуры));
			
			ПоказатьПредупреждение(, ТекстОшибки, 45);
			Возврат;
		КонецЕсли;	
		
		Если ВыборПодразделение И ВыборСклада Тогда
			
			ТекстОшибки = НСтр("ru = 'Выбраны строки с получателями разных типов. Операция не может быть выполнена.'");
								   
			ПоказатьПредупреждение(, ТекстОшибки, 45);
			Возврат;
		КонецЕсли;	
		
		Если ВыборСклада Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			Если ПараметрыТЧ.Свойство("Отбор") Тогда
				ПараметрыФормы.Вставить("Отбор", ПараметрыТЧ.Отбор);
			КонецЕсли;
			
			ОткрытьФорму("Справочник.Склады.ФормаВыбора", ПараметрыФормы, Форма,,,,
						  ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;	
		
		Если ВыборПодразделение Тогда
			
			ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора",, Форма,,,,
						  ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область РасчетДолейСтоимости

// Функция проверяет необходимость обновления процента распределения затрат на выходные изделия.
//
// Параметры:
//  ТаблицаФормы				 - ТаблицаФормы	 - таблица формы, отображающая ТЧ;
//  ПараметрыРаспределенияЗатрат - Структура	 - структура параметров расчета, см. ПроизводствоКлиентСервер.ПараметрыРаспределенияЗатратНаВыходныеИзделия()
//  КэшированныеЗначения		 - Структура	 - структура кеша реквизитов текущей строки.
//  ДобавлениеУдаление			 - Булево		 - признак, что проверка вызывается при добавлении/удалении строки ТЧ.
// 
// Возвращаемое значение:
//  Булево - истина, если нужно ли обновить служебные реквизиты.
//
Функция НеобходимоРассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(ТабличнаяЧасть, ПараметрыРаспределенияЗатрат, КэшированныеЗначения = Неопределено, ДобавлениеУдаление = Ложь) Экспорт
	
	ДанныеСтроки = ТабличнаяЧасть.ТекущиеДанные;
	
	Если ДобавлениеУдаление Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		СпособРаспределенияЗатратНаВыходныеИзделия = ПараметрыРаспределенияЗатрат.СпособРаспределенияЗатратНаВыходныеИзделия;
	Иначе
		СпособРаспределенияЗатратНаВыходныеИзделия = ДанныеСтроки[ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("ДоляСтоимости");
	ПроверяемыеПоля.Добавить(ПараметрыРаспределенияЗатрат.ПоляСвязи);
	
	Если ЗначениеЗаполнено(ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат) Тогда
		ПроверяемыеПоля.Добавить(ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат);
	КонецЕсли;
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости")
		И ДанныеСтроки <> Неопределено
		И ДанныеСтроки.ДоляСтоимости = 0 Тогда
		ПроверяемыеПоля.Добавить("Количество");
	КонецЕсли;
	
	Если ПараметрыРаспределенияЗатрат.ЕстьПолеОтменено Тогда
		ПроверяемыеПоля.Добавить("Отменено");
	КонецЕсли;
	
	Если ДанныеСтроки <> Неопределено
		И КэшированныеЗначения <> Неопределено
		И ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
			КэшированныеЗначения,
			ДанныеСтроки,
			СтрСоединить(ПроверяемыеПоля,",")) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Предназначена для проверки заполнения полей перед выполнением команды по вводу доли стоимости.
//
// Параметры:
//  ДанныеСтроки				 - ДанныеФормыСтруктура	 - данные строки, в которой осуществляется ввод доли стоимости.
//  ПараметрыРаспределенияЗатрат - Структура			 - структура параметров расчета, см. ПроизводствоКлиентСервер.ПараметрыРаспределенияЗатратНаВыходныеИзделия()
//  ИмяОбъекта					 - Строка				 - имя основного реквизита формы, связанного с редактируемым объектом.
// 
// Возвращаемое значение:
//  Булево - истина, если проверка заполнения выполнена успешно, ложь - в противном случае.
//
Функция ПроверитьЗаполнениеПередВводомДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат, ИмяОбъекта = "Объект") Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ошибки = Новый Массив();
	
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Номенклатура) Тогда
		Текст = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Номенклатура'"));
		Ошибка = Новый Структура("Поле, Текст", "Номенклатура", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	Если (ДанныеСтроки.КоличествоУпаковок = 0 ИЛИ ДанныеСтроки.Количество = 0) 
		И (НЕ ПараметрыРаспределенияЗатрат.ЕстьПараметризацияРесурснойСпецификации
			ИЛИ ПараметрыРаспределенияЗатрат.ЕстьПараметризацияРесурснойСпецификации И НЕ ДанныеСтроки.РасчетПоФормуле) Тогда
		Текст = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Количество'"));
		Ошибка = Новый Структура("Поле, Текст", "КоличествоУпаковок", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	Если Не ДоступнаРасшифровкаРасчетаДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат) Тогда
		Текст = НСтр("ru = 'Недостаточно прав доступа для открытия формы расшифровки расчета доли стоимости.'");
		Ошибка = Новый Структура("Поле, Текст", "ДоляСтоимости", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	ОшибкиПользователю = Неопределено;

	Для каждого Ошибка Из Ошибки Цикл
		Поле = СтрШаблон(ИмяОбъекта + ".%1[%2].%3", ПараметрыРаспределенияЗатрат.ИмяТЧ, Формат(ДанныеСтроки.НомерСтроки - 1, "ЧН=0; ЧГ=0"), Ошибка.Поле);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, Поле, Ошибка.Текст, "");
	КонецЦикла;

	ОчиститьСообщения();
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиПользователю);

	Возврат Ошибки.Количество() = 0;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетДолейСтоимости

Функция ДоступнаРасшифровкаРасчетаДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат) Экспорт
	
	Если ПустаяСтрока(ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		СпособРаспределенияЗатратНаВыходныеИзделия = ПараметрыРаспределенияЗатрат.СпособРаспределенияЗатратНаВыходныеИзделия;
	Иначе
		СпособРаспределенияЗатратНаВыходныеИзделия = ДанныеСтроки[ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия];
	КонецЕсли;
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоПлановойСтоимости") Тогда
		ЕстьДоступ = ПроизводствоВызовСервера.ДоступнаРасшифровкаРасчетаДолиСтоимости(СпособРаспределенияЗатратНаВыходныеИзделия);
	Иначе
		ЕстьДоступ = Истина;
	КонецЕсли;
	
	Возврат ЕстьДоступ;
	
КонецФункции

#КонецОбласти

#Область ДвижениеПродукцииИМатериалов

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьВыпускПродукцииНаОсновании".
//
Функция СоздатьПередачуПродукцииИзКладовойНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт

	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	СоздатьДвижениеПродукцииИМатериаловНаОсновании(
		ПараметрыВыполнения.ОписаниеКоманды, 
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой"));
	
КонецФункции

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьПередачуМатериаловНаОсновании".
//
Функция СоздатьПередачуМатериаловВКладовуюНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	СоздатьДвижениеПродукцииИМатериаловНаОсновании(
		ПараметрыВыполнения.ОписаниеКоманды, 
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую"));
	
КонецФункции

Процедура СоздатьДвижениеПродукцииИМатериаловНаОсновании(ОписаниеКоманды, ХозяйственнаяОперация)
	
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
		ОписаниеКоманды.ОбъектыОснований, ХозяйственнаяОперация);
	
	Если ПараметрыОткрытия.РезультатыПроверки.ЕстьОшибки Тогда
		
		НакладныеКлиент.СообщитьОбОшибкахЗаполненияВнутреннейНакладной(ПараметрыОткрытия.РезультатыПроверки.ТекстОшибки);
		
	Иначе
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры);
		
		ОткрытьФорму(
			"Документ.ДвижениеПродукцииИМатериалов.ФормаОбъекта",
			ПараметрыОткрытия,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьВыпускПродукцииБезЗаказаНаОсновании".
//
Функция СоздатьВыпускПродукцииБезЗаказаНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт

	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(,
		"ОбщийМодуль.ПроизводствоКлиент.СоздатьВыпускПродукцииБезЗаказаНаОсновании");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	ПараметрыДокументов = Новый Структура;
	ПараметрыДокументов.Вставить("ОбъектыОснований", Массив);
	
	ФормаДокумента = ПолучитьФорму("Документ.ДвижениеПродукцииИМатериалов.ФормаОбъекта",,, ПараметрыВыполнения.Форма,);
	ПараметрыДокументов.Вставить("ОбъектФормы", ФормаДокумента.Объект);
	
	ИдентификаторФормы = Строка(ПараметрыВыполнения.Форма.УникальныйИдентификатор);
	ПараметрыДокументов.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	
	Результат = ПроизводствоВызовСервера.ДокументыДвиженияПродукцииИМатериаловПоПараметрам(ПараметрыДокументов);
	
	Если Результат.Свойство("ОткрытьФормуНового") Тогда
		
		КопироватьДанныеФормы(ПараметрыДокументов.ОбъектФормы, ФормаДокумента.Объект);
		ФормаДокумента.ОбновитьПриОткрытии = Истина;
		ФормаДокумента.Модифицированность = Истина;
		ФормаДокумента.Открыть();
		
	ИначеЕсли Результат.КоличествоСозданныхДокументов > 1 Тогда
		
		НакладныеКлиент.ОткрытьФормуСозданныхДокументов(Результат, ПараметрыВыполнения.Форма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Не сформировано ни одного документа. Отсутствует продукция, требующая передачи на склад.'"));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Заполнение

// Заполняет служебные реквизиты в строке на основании выбранного склада
//
// Параметры:
//  ТекущаяСтрока		 - Структура - данные обрабатываемой строки.
//  Параметры			 - Структура - вспомогательные параметры для заполнения.
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке.
//
Процедура ЗаполнитьПризнакЦеховаяКладовая(ТекущаяСтрока, Параметры, КэшированныеЗначения) Экспорт
	
	ИмяПоляСклад = "Склад";
	ЗаполнитьПодразделение = Ложь;
	
	Если Параметры <> Неопределено Тогда
		
		Если Параметры.Свойство("ИмяПоляСклад") Тогда
			ИмяПоляСклад = Параметры.ИмяПоляСклад;	
		КонецЕсли;
			
		Если Параметры.Свойство("ЗаполнитьПодразделение") Тогда
			ЗаполнитьПодразделение = Параметры.ЗаполнитьПодразделение;	
		КонецЕсли;		
			
	КонецЕсли;
		
	ЗначениеСклада = ТекущаяСтрока[ИмяПоляСклад];	
	
	Если ЗначениеЗаполнено(ЗначениеСклада) И ТипЗнч(ЗначениеСклада) = Тип("СправочникСсылка.Склады") Тогда
		
		СвойстваСклада = КэшированныеЗначения.СвойстваСкладов.Получить(ЗначениеСклада);
		
		Если СвойстваСклада = Неопределено Тогда
			
			ТекстИсключения = 
				НСтр("ru = 'Попытка заполнения служебных реквизитов на основании выбранного склада на клиенте.'");
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;	
		
		ЦеховаяКладовая = СвойстваСклада.ЦеховаяКладовая;
		Подразделение = СвойстваСклада.Подразделение;
		
	Иначе
		
		ЦеховаяКладовая = Ложь;
		Подразделение = Неопределено;
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦеховаяКладовая = ЦеховаяКладовая;
	
	Если ЗаполнитьПодразделение И ТекущаяСтрока.ЦеховаяКладовая Тогда
		ТекущаяСтрока.Подразделение = Подразделение;
	КонецЕсли;
	
	Если ТекущаяСтрока.Свойство("НужноОкруглять") Тогда
		ТекущаяСтрока.НужноОкруглять = Не ТекущаяСтрока.ЦеховаяКладовая;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

// Обработчик команды ввода на основании "Документ.АктВыполненныхВнутреннихРабот.СозданиеАктаВыполненныхВнутреннихРабот".
Функция СоздатьАктВыполненныхВнутреннихРаботНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(,
		"ОбщийМодуль.ПроизводствоКлиент.СоздатьАктВыполненныхВнутреннихРаботНаОсновании");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	РезультатПроверки = ПроизводствоВызовСервера.СоздатьАктВыполненныхВнутреннихРаботПроверкаОснований(МассивСсылок);
	Если РезультатПроверки.Свойство("ЕстьОшибки") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.ТекстОшибки);
	Иначе
		ПараметрыОснование = Новый Структура;
		ПараметрыОснование.Вставить("ОбъектыОснований",	МассивСсылок);
		ПараметрыОснование.Вставить("РеквизитыШапки",	РезультатПроверки.РеквизитыШапки);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", ПараметрыОснование);
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
		
		ИмяФормы = "Документ.АктВыполненныхВнутреннихРабот.ФормаОбъекта";
		ОткрытьФорму(
				ИмяФормы,
				ПараметрыОткрытия,
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно,
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
